frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4cm/include/sam.h
/**
 * \file
 *
 * \brief Top level header file
 *
 * Copyright (c) 2016 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM_
#define _SAM_

#if   defined(__SAM4CMP16C_0__) || defined(__ATSAM4CMP16C_0__)
  #include "sam4cmp16c_0.h"
#elif defined(__SAM4CMP16C_1__) || defined(__ATSAM4CMP16C_1__)
  #include "sam4cmp16c_1.h"
#elif defined(__SAM4CMP8C_0__) || defined(__ATSAM4CMP8C_0__)
  #include "sam4cmp8c_0.h"
#elif defined(__SAM4CMP8C_1__) || defined(__ATSAM4CMP8C_1__)
  #include "sam4cmp8c_1.h"
#elif defined(__SAM4CMS16C_0__) || defined(__ATSAM4CMS16C_0__)
  #include "sam4cms16c_0.h"
#elif defined(__SAM4CMS16C_1__) || defined(__ATSAM4CMS16C_1__)
  #include "sam4cms16c_1.h"
#elif defined(__SAM4CMS4C_0__) || defined(__ATSAM4CMS4C_0__)
  #include "sam4cms4c_0.h"
#elif defined(__SAM4CMS4C_1__) || defined(__ATSAM4CMS4C_1__)
  #include "sam4cms4c_1.h"
#elif defined(__SAM4CMS8C_0__) || defined(__ATSAM4CMS8C_0__)
  #include "sam4cms8c_0.h"
#elif defined(__SAM4CMS8C_1__) || defined(__ATSAM4CMS8C_1__)
  #include "sam4cms8c_1.h"
#else
  #error Library does not support the specified device
#endif

#endif /* _SAM_ */

